In [41]:
## importing Dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [111]:
df_date = pd.read_csv(r"C:\Users\Shubham\Music\Codebasics\Input Files\Input Files\dim_date.csv")
df_date.head()

        date  mmm yy week no  day_type
0  01-May-22  May 22    W 19   weekend
1  02-May-22  May 22    W 19  weekeday
2  03-May-22  May 22    W 19  weekeday
3  04-May-22  May 22    W 19  weekeday
4  05-May-22  May 22    W 19  weekeday

In [168]:
df_date['day_type'].value_counts()

weekeday    65
weekend     27
Name: day_type, dtype: int64

In [113]:
# df_date.isnull().sum()

In [114]:
df_hotel = pd.read_csv(r"C:\Users\Shubham\Music\Codebasics\Input Files\Input Files\dim_hotels.csv")
df_hotel.head()

   property_id  property_name  category    city
0        16558   Atliq Grands    Luxury   Delhi
1        16559  Atliq Exotica    Luxury  Mumbai
2        16560     Atliq City  Business   Delhi
3        16561      Atliq Blu    Luxury   Delhi
4        16562      Atliq Bay    Luxury   Delhi

In [115]:
df_hotel.shape

(25, 4)

In [116]:
df_hotel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_id    25 non-null     int64
 1   property_name  25 non-null     object
 2   category       25 non-null     object
 3   city           25 non-null     object
dtypes: int64(1), object(3)
memory usage: 928.0+ bytes

In [117]:
df_hotel.describe()

        property_id
count     25.000000
mean   18040.640000
std     1122.436371
min    16558.000000
25%    17558.000000
50%    17564.000000
75%    18563.000000
max    19563.000000

In [118]:
df_room = pd.read_csv(r"C:\Users\Shubham\Music\Codebasics\Input Files\Input Files\dim_rooms.csv")
df_room.head()

  room_id    room_class
0     RT1      Standard
1     RT2         Elite
2     RT3       Premium
3     RT4  Presidential

In [119]:
df_room.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   room_id     4 non-null      object
 1   room_class  4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes

In [120]:
df_room.shape

(4, 2)

In [121]:
df_agg = pd.read_csv(r"C:\Users\Shubham\Music\Codebasics\Input Files\Input Files\fact_aggregated_bookings.csv")
df_agg.head()

   property_id check_in_date room_category  successful_bookings  capacity
0        16559     01-May-22           RT1                   25        30
1        19562     01-May-22           RT1                   28        30
2        19563     01-May-22           RT1                   23        30
3        17558     01-May-22           RT1                   13        19
4        16558     01-May-22           RT1                   18        19

In [122]:
df_agg.shape

(9200, 5)

In [123]:
df_agg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9200 entries, 0 to 9199
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   property_id          9200 non-null   int64
 1   check_in_date        9200 non-null   object
 2   room_category        9200 non-null   object
 3   successful_bookings  9200 non-null   int64
 4   capacity             9200 non-null   int64
dtypes: int64(3), object(2)
memory usage: 359.5+ KB

In [124]:
df_fact = pd.read_csv(r"C:\Users\Shubham\Music\Codebasics\Input Files\Input Files\fact_bookings.csv")
df_fact.head()

,booking_id,property_id,booking_date,check_in_date,checkout_date,no_guests,room_category,booking_platform,ratings_given,booking_status,revenue_generated,revenue_realized
0,May012216558RT11,16558,2022-04-27,2022-05-01,2022-05-02,3,RT1,direct online,1.0,Checked Out,10010,10010
1,May012216558RT12,16558,2022-04-30,2022-05-01,2022-05-02,2,RT1,others,NaN,Cancelled,9100,3640
2,May012216558RT13,16558,2022-04-28,2022-05-01,2022-05-04,2,RT1,logtrip,5.0,Checked Out,9100,9100
3,May012216558RT14,16558,2022-04-28,2022-05-01,2022-05-02,2,RT1,others,NaN,Cancelled,9100,3640
4,May012216558RT15,16558,2022-04-27,2022-05-01,2022-05-02,4,RT1,direct online,5.0,Checked Out,10920,10920

In [125]:
df_fact.shape

(134590, 12)

In [151]:
df_fact['booking_platform'].value_counts()

others            55066
makeyourtrip      26898
logtrip           14756
direct online     13379
tripster           9630
journey            8106
direct offline     6755
Name: booking_platform, dtype: int64

In [126]:
df_fact.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134590 entries, 0 to 134589
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   booking_id         134590 non-null  object
 1   property_id        134590 non-null  int64
 2   booking_date       134590 non-null  object
 3   check_in_date      134590 non-null  object
 4   checkout_date      134590 non-null  object
 5   no_guests          134590 non-null  int64
 6   room_category      134590 non-null  object
 7   booking_platform   134590 non-null  object
 8   ratings_given      56683 non-null   float64
 9   booking_status     134590 non-null  object
 10  revenue_generated  134590 non-null  int64
 11  revenue_realized   134590 non-null  int64
dtypes: float64(1), int64(4), object(7)
memory usage: 12.3+ MB

In [167]:
df_hotel_agg = pd.merge(df2,df4, on= 'property_id', how= 'inner')
df_hotel_agg.head(10)

,property_id,property_name,category,city,check_in_date,room_category,successful_bookings,capacity
0,16558,Atliq Grands,Luxury,Delhi,01-May-22,RT1,18,19
1,16558,Atliq Grands,Luxury,Delhi,01-May-22,RT2,21,22
2,16558,Atliq Grands,Luxury,Delhi,01-May-22,RT3,8,8
3,16558,Atliq Grands,Luxury,Delhi,01-May-22,RT4,3,3
4,16558,Atliq Grands,Luxury,Delhi,02-May-22,RT1,12,19
5,16558,Atliq Grands,Luxury,Delhi,02-May-22,RT2,14,22
6,16558,Atliq Grands,Luxury,Delhi,02-May-22,RT3,5,8
7,16558,Atliq Grands,Luxury,Delhi,02-May-22,RT4,2,3
8,16558,Atliq Grands,Luxury,Delhi,03-May-22,RT1,14,19
9,16558,Atliq Grands,Luxury,Delhi,03-May-22,RT2,14,22

In [128]:
df_hotel_agg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9200 entries, 0 to 9199
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   property_id          9200 non-null   int64
 1   property_name        9200 non-null   object
 2   category             9200 non-null   object
 3   city                 9200 non-null   object
 4   check_in_date        9200 non-null   object
 5   room_category        9200 non-null   object
 6   successful_bookings  9200 non-null   int64
 7   capacity             9200 non-null   int64
dtypes: int64(3), object(5)
memory usage: 646.9+ KB

In [129]:
df_hotel_agg.shape

(9200, 8)

In [152]:
df_hotel_agg['city'].value_counts()

Mumbai       2944
Hyderabad    2208
Bangalore    2208
Delhi        1840
Name: city, dtype: int64

In [153]:
df_hotel_agg['property_name'].value_counts()

Atliq Grands     1472
Atliq Exotica    1472
Atliq City       1472
Atliq Blu        1472
Atliq Bay        1472
Atliq Palace     1472
Atliq Seasons     368
Name: property_name, dtype: int64

In [158]:
df_hotel_agg['category'].value_counts()

Luxury      5888
Business    3312
Name: category, dtype: int64

In [159]:
df_hotel_agg['property_id'].value_counts()

16558    368
18559    368
19563    368
19562    368
19561    368
19560    368
19559    368
19558    368
18563    368
18562    368
18561    368
18560    368
18558    368
16559    368
17563    368
17562    368
17561    368
17560    368
17559    368
17558    368
16563    368
16562    368
16561    368
16560    368
17564    368
Name: property_id, dtype: int64

In [160]:
df_hotel_fact = pd.merge(df2,df5, on= 'property_id', how= 'inner')

In [161]:
df_hotel_fact.shape

(134590, 15)

In [162]:
df_hotel_fact.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 134590 entries, 0 to 134589
Data columns (total 15 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   property_id        134590 non-null  int64
 1   property_name      134590 non-null  object
 2   category           134590 non-null  object
 3   city               134590 non-null  object
 4   booking_id         134590 non-null  object
 5   booking_date       134590 non-null  object
 6   check_in_date      134590 non-null  object
 7   checkout_date      134590 non-null  object
 8   no_guests          134590 non-null  int64
 9   room_category      134590 non-null  object
 10  booking_platform   134590 non-null  object
 11  ratings_given      56683 non-null   float64
 12  booking_status     134590 non-null  object
 13  revenue_generated  134590 non-null  int64
 14  revenue_realized   134590 non-null  int64
dtypes: float64(1), int64(4), object(10)
memory usage: 16.4+ MB

In [163]:
df_hotel_fact.head()

,property_id,property_name,category,city,booking_id,booking_date,check_in_date,checkout_date,no_guests,room_category,booking_platform,ratings_given,booking_status,revenue_generated,revenue_realized
0,16558,Atliq Grands,Luxury,Delhi,May012216558RT11,2022-04-27,2022-05-01,2022-05-02,3,RT1,direct online,1.0,Checked Out,10010,10010
1,16558,Atliq Grands,Luxury,Delhi,May012216558RT12,2022-04-30,2022-05-01,2022-05-02,2,RT1,others,NaN,Cancelled,9100,3640
2,16558,Atliq Grands,Luxury,Delhi,May012216558RT13,2022-04-28,2022-05-01,2022-05-04,2,RT1,logtrip,5.0,Checked Out,9100,9100
3,16558,Atliq Grands,Luxury,Delhi,May012216558RT14,2022-04-28,2022-05-01,2022-05-02,2,RT1,others,NaN,Cancelled,9100,3640
4,16558,Atliq Grands,Luxury,Delhi,May012216558RT15,2022-04-27,2022-05-01,2022-05-02,4,RT1,direct online,5.0,Checked Out,10920,10920

In [164]:
df_hotel_fact['city'].value_counts()

Mumbai       43455
Hyderabad    34888
Bangalore    32016
Delhi        24231
Name: city, dtype: int64

### Total sum of Revenue_Realized

In [134]:
df_hotel_fact['revenue_realized'].sum()

1708771229

### Total sum of Revenue_Realized from each room_category

In [136]:
df_hotel_fact.groupby(['room_category','category'])['revenue_realized'].sum().unstack()

category        Business     Luxury
room_category
RT1            116611001  192969894
RT2            214553502  345717702
RT3            158360568  303805776
RT4            166494226  210258560

## Count Of booking Id in Fact_bookings?

In [137]:
df_fact['booking_id'].nunique()

134590

## Average Of Rating given

In [138]:
df_hotel_fact['ratings_given'].mean()

3.619003934160154

## Sum of capacity

In [139]:
total_capacity = df_agg['capacity'].sum()
total_capacity

232576

## Sum of successful_bookings from fact_bookings

In [140]:
Total_successful_bking = df_agg['successful_bookings'].sum()
Total_successful_bking

134590

## Ratio of Total Successful Bookings to Total Capacity

In [141]:
Occupancy_ratio = Total_successful_bking / total_capacity

In [142]:
Occupancy_ratio

0.5786925564116676

## Count of booking_id in which booking_status = "Cancelled"

In [143]:
df_hotel_fact.groupby('booking_status')['booking_id'].count().reset_index()

  booking_status  booking_id
0      Cancelled       33420
1    Checked Out       94411
2        No Show        6759

In [144]:
no_cancelled = df_hotel_fact.groupby('booking_status')['booking_id'].count().reset_index().iloc[:-2,1:]

## Ratio of 'Total Cancelled Bookings' to 'Total Bookings'

In [145]:
cancelleation_rate = no_cancelled/ Total_successful_bking *100

In [146]:
cancelleation_rate

   booking_id
0   24.830968